from pykakasi import kakasi
# import dictfile
# DICT = dictfile.dict


class Test:
  """
  Test: pykakasiのテスト用class
  (classで管理するとすっきりするよ～)
  """
  #初期化関数
  def __init__(self, in_word) -> None:
    self.kakasi = kakasi()  # kakasi()を呼び出してオブジェクトを作成
    self.in_word = in_word  # 変換する文字列を保持
    
  # test要
  def test(self) -> list:
    """
    description: 入れられた文字列をkakashiを用いて返す
    -----------------
    in_word: str -> 変換する前の文字
    -----------------
    return out_word: list -> 変換した後のlist
    """
    out_word = self.kakasi.convert(self.in_word)
    return out_word


  #ひらがなに変換
  def hira(self) -> list:
    result = self.kakasi.convert(self.in_word)
    out_hira = ""
    for i in result:
      out_hira += i["hira"]
    return out_hira


  # ペン語に翻訳
  def translation(self) -> list:
    
    result = self.kakasi.convert(self.in_word)
    out_word = ""
    out_pen = ""
    Dict = {
      "あ":"ぺぺ",
      "い":"ぺーぺ",
      "う":"ンンー",
      "え":"ーンぺー",
      "お":"ぺぺぺー",
      "か":"ーぺ",
      "き":"ーぺぺン",
      "く":"ぺンーン",
      "け":"ぺぺン",
      "こ":"ぺンンー",
      "さ":"ぺン",
      "し":"ーぺぺぺ",
      "す":"ーぺー",
      "せ":"ーーーー",
      "そ":"ンーン",
      "た":"ぺーン",
      "ち":"ンぺ",
      "つ":"ンンンー",
      "て":"ーンぺ",
      "と":"ぺぺーぺ",
      "な":"ンンぺー",
      "に":"ンンぺ",
      "ぬ":"ぺンンン",
      "ね":"ーンー",
      "の":"ンンンぺ",
      "は":"ぺーー",
      "ひ":"ーンンー",
      "ふ":"ーぺぺー",
      "へ":"ンー",
      "ほ":"ンンーー",
      "ま":"ーぺーぺ",
      "み":"ぺンー",
      "む":"ーンンぺ",
      "め":"ぺぺーン",
      "も":"ぺンぺ",
      "や":"ーンンン",
      "ゆ":"ーンーー",
      "よ":"ンーー",
      "ら":"ンンンン",
      "り":"ーーンー",
      "る":"ーンーン",
      "れ":"ンぺーー",
      "ろ":"ンぺンー",
      "わ":"ーンン",
      "を":"ぺぺぺぺ",
      "ん":"ン",
      "が":"ぺーンー",
      "ぎ":"ぺぺンぺ",
      "ぐ":"ンぺぺぺ",
      "げ":"ンぺー",
      "ご":"ンーーー",
      "ざ":"ぺンーー",
      "じ":"ーぺンー",
      "ず":"ーーぺぺ",
      "ぜ":"ンぺぺ",
      "ぞ":"ぺンンぺ",
      "だ":"ンぺぺー",
      "ぢ":"ンぺンぺ",
      "づ":"ンン",
      "で":"ぺンぺン",
      "ど":"ンぺン",
      "ば":"ンぺぺン",
      "び":"ぺンぺー",
      "ぶ":"ぺンン",
      "べ":"ぺぺぺン",
      "ぼ":"ぺぺンー",
      "ぱ":"ぺーぺぺ",
      "ぴ":"ぺーぺン",
      "ぷ":"ーぺぺ",
      "ぺ":"ぺ",
      "ぽ":"ーーぺ",
      "ヴ":"ンンー",
      # (一組足りなかったためウと同一)
      "、":"ーーンぺ",
      "。":"ーンぺン",
      "!":"ンーぺ",
      "？":"ぺーンン",
      "・":"ンーンぺ",
      "ゃ":"ぺーーぺ",
      "ゅ":"ーぺン",
      "ょ":"ーぺーン",
      "っ":"ぺぺぺ",
      "ー":"ー",
      "1":"ーぺンぺ",
      "2":"ーー",
      "3":"ンーンー",
      "4":"ぺーーン",
      "5":"ンぺーぺ",
      "6":"ぺンぺぺ",
      "7":"ーーーン",
      "8":"ぺーンぺ",
      "9":"ンーぺぺ",
      "0":"ぺー",
      "a":"ぺーぺー",
      "b":"ンーぺン",
      "c":"ンンぺン",
      "d":"ーンぺぺ",
      "e":"ぺぺーー",
      "f":"ンンーン",
      "g":"ぺンーぺ",
      "h":"ーーぺン",
      "i":"ぺーーー",
      "j":"ンーぺー",
      "k":"ーーンン",
      "l":"ーーン",
      "m":"ンンーぺ",
      "n":"ンぺーン",
      "o":"ンーーぺ",
      "p":"ぺぺー",
      "q":"ンーンン",
      "r":"ーーぺー",
      "s":"ーぺーー",
      "t":"ンンぺぺ",
      "u":"ンンン",
      "v":"ーーーぺ",
      "w":"ンーーン",
      "x":"ーーー",
      "y":"ーンーぺ",
      "z":"ーン",
      "ぁ":"ぺぺ",
      "ぃ":"ぺーぺ",
      "ぅ":"ンンー",
      "ぇ":"ーンぺー",
      "ぉ":"ぺぺぺー"
    }

    for converted_word in result:
      out_word += converted_word['hira']
    List = list(out_word)
    for i in List:
      out_pen += Dict.get(i,"?") + "　"
    
    return out_pen